
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user Stata license expires 15 Jul 2021:
       Serial number:  401609316897
         Licensed to:  Diana Ricciulli
                       Universidad de los Andes

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /Users/dianaricciulli/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. log using "/Users/dianaricciulli/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/dianaricciulli/.ipython/stata/log_output.log
  log type:  text
 opened on:  26 Jun 2020, 11:00:51

. cd "/Users/dianaricciulli/Dropbox/2020/Economic Growth Course/Mitton-TheWealthofSubnations-2016/data/original_data"
/Users/dianaricciulli/Dropbox/2020/Economic Growth Course/Mitton-TheWealthofSubnations-2016/data/original_data

. quietly do "/Users/dianaricciulli/Dropbox/2020/Economic Growth Course/Mitton-TheWealthofSubnations-2016/original_do/original_table11.do"

. xtreg loggdppc_pppz oceanaccessz logtriz logstormcountz  trop_pctz dtr_avgz oilandgasz diamondz   iron_sqkmz alloyants_sqkmz  soilqualityz , fe cluster(country)

Fixed-effects (within) regression               Number of obs      =      1783
Group variable: countrynum                      Number of groups   =        98

R-sq:  within  = 0.1124                         Obs per group: min =         1
       between = 0.4850                                        avg =      18.2
       overall = 0.3257                                        max =        79

                                                F(10,97)           =     32.93
corr(u_i, Xb)  = 0.4181                         Prob > F           =    0.0000

                                  (Std. Err. adjusted for 98 clusters in country)
---------------------------------------------------------------------------------
                |               Robust
  loggdppc_pppz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
   oceanaccessz |   .0564971   .0214837     2.63   0.010      .013858    .0991363
        logtriz |  -.0924779   .0193806    -4.77   0.000    -.1309431   -.0540127
 logstormcountz |   -.093495   .0302572    -3.09   0.003    -.1535473   -.0334428
      trop_pctz |  -.1112627    .057655    -1.93   0.057    -.2256919    .0031665
       dtr_avgz |   -.082418   .0238732    -3.45   0.001    -.1297998   -.0350362
     oilandgasz |   .0109251   .0038072     2.87   0.005     .0033688    .0184814
       diamondz |   .0133359   .0038219     3.49   0.001     .0057505    .0209214
     iron_sqkmz |    .011075   .0042104     2.63   0.010     .0027185    .0194314
alloyants_sqkmz |   .0211742   .0099074     2.14   0.035     .0015108    .0408376
   soilqualityz |  -.0483545   .0175636    -2.75   0.007    -.0832135   -.0134956
          _cons |  -.0060497   .0014678    -4.12   0.000    -.0089629   -.0031365
----------------+----------------------------------------------------------------
        sigma_u |  .85930321
        sigma_e |  .34862224
            rho |  .85866742   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. xtreg loggdppc_pppz instXauto oceanaccessz logtriz logstormcountz  trop_pctz dtr_avgz oilandgasz diamondz   iron_sqkmz alloyants_sqkmz  soilqualityz inst_allz autoregionz, fe cluster(country)

Fixed-effects (within) regression               Number of obs      =      1287
Group variable: countrynum                      Number of groups   =        84

R-sq:  within  = 0.1286                         Obs per group: min =         1
       between = 0.4362                                        avg =      15.3
       overall = 0.3013                                        max =        63

                                                F(13,83)           =     59.36
corr(u_i, Xb)  = 0.3636                         Prob > F           =    0.0000

                                  (Std. Err. adjusted for 84 clusters in country)
---------------------------------------------------------------------------------
                |               Robust
  loggdppc_pppz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
      instXauto |   .0511328   .0148739     3.44   0.001     .0215493    .0807163
   oceanaccessz |   .0347034   .0175473     1.98   0.051    -.0001975    .0696044
        logtriz |   -.095248   .0241532    -3.94   0.000    -.1432879   -.0472082
 logstormcountz |  -.1202208   .0250585    -4.80   0.000    -.1700612   -.0703805
      trop_pctz |  -.0950142   .0748367    -1.27   0.208    -.2438614     .053833
       dtr_avgz |  -.0912678   .0264442    -3.45   0.001    -.1438641   -.0386714
     oilandgasz |   .0127256   .0029772     4.27   0.000     .0068041    .0186472
       diamondz |   .0106138   .0031621     3.36   0.001     .0043245    .0169032
     iron_sqkmz |   .0108813   .0025491     4.27   0.000     .0058113    .0159513
alloyants_sqkmz |   .0184573   .0081073     2.28   0.025     .0023321    .0345825
   soilqualityz |  -.0541342   .0186907    -2.90   0.005    -.0913092   -.0169592
      inst_allz |   .0030116   .0247365     0.12   0.903    -.0461883    .0522116
    autoregionz |    -.01641   .0173798    -0.94   0.348    -.0509778    .0181578
          _cons |  -.0440162   .0073279    -6.01   0.000     -.058591   -.0294413
----------------+----------------------------------------------------------------
        sigma_u |  .82687551
        sigma_e |  .33298441
            rho |  .86046014   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
. xtreg loggdppc_pppz oceanaccessz logtriz logstormcountz  trop_pctz dtr_avgz oilandgasz diamondz   iron_sqkmz alloyants_sqkmz  soilqualityz if nlargestcity==0, fe cluster(country)

Fixed-effects (within) regression               Number of obs      =      1695
Group variable: countrynum                      Number of groups   =        97

R-sq:  within  = 0.0997                         Obs per group: min =         3
       between = 0.5112                                        avg =      17.5
       overall = 0.3485                                        max =        78

                                                F(10,96)           =     35.56
corr(u_i, Xb)  = 0.4641                         Prob > F           =    0.0000

                                  (Std. Err. adjusted for 97 clusters in country)
---------------------------------------------------------------------------------
                |               Robust
  loggdppc_pppz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
   oceanaccessz |   .0599587   .0217339     2.76   0.007     .0168174    .1031001
        logtriz |  -.0731933   .0213178    -3.43   0.001    -.1155088   -.0308778
 logstormcountz |  -.0800301    .031634    -2.53   0.013    -.1428231   -.0172372
      trop_pctz |   -.108046   .0554835    -1.95   0.054    -.2181798    .0020878
       dtr_avgz |  -.0718788   .0241202    -2.98   0.004    -.1197571   -.0240006
     oilandgasz |   .0097142   .0040246     2.41   0.018     .0017254     .017703
       diamondz |   .0149331   .0043946     3.40   0.001     .0062099    .0236563
     iron_sqkmz |   .0118514   .0049012     2.42   0.017     .0021226    .0215802
alloyants_sqkmz |   .0190533   .0099151     1.92   0.058     -.000628    .0387347
   soilqualityz |  -.0380253   .0208083    -1.83   0.071    -.0793295    .0032789
          _cons |  -.0305766   .0015758   -19.40   0.000    -.0337044   -.0274487
----------------+----------------------------------------------------------------
        sigma_u |  .87592436
        sigma_e |  .33145681
            rho |  .87474321   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. xtreg loggdppc_pppz instXauto oceanaccessz logtriz logstormcountz  trop_pctz dtr_avgz oilandgasz diamondz   iron_sqkmz alloyants_sqkmz  soilqualityz  inst_allz autoregionz if nlargestcity==0 , fe cl
> uster(country)

Fixed-effects (within) regression               Number of obs      =      1212
Group variable: countrynum                      Number of groups   =        84

R-sq:  within  = 0.1094                         Obs per group: min =         1
       between = 0.4661                                        avg =      14.4
       overall = 0.3277                                        max =        62

                                                F(13,83)           =     54.76
corr(u_i, Xb)  = 0.4266                         Prob > F           =    0.0000

                                  (Std. Err. adjusted for 84 clusters in country)
---------------------------------------------------------------------------------
                |               Robust
  loggdppc_pppz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
      instXauto |   .0480321   .0138792     3.46   0.001     .0204269    .0756373
   oceanaccessz |   .0398196   .0170014     2.34   0.022     .0060044    .0736348
        logtriz |  -.0711681   .0270483    -2.63   0.010    -.1249661   -.0173701
 logstormcountz |  -.0991744   .0263604    -3.76   0.000    -.1516041   -.0467447
      trop_pctz |  -.0928082   .0718074    -1.29   0.200    -.2356302    .0500138
       dtr_avgz |  -.0753629   .0267507    -2.82   0.006    -.1285689   -.0221569
     oilandgasz |   .0108256   .0031296     3.46   0.001     .0046009    .0170502
       diamondz |   .0125994   .0036776     3.43   0.001     .0052849     .019914
     iron_sqkmz |   .0115941   .0030018     3.86   0.000     .0056237    .0175645
alloyants_sqkmz |   .0168981   .0089543     1.89   0.063    -.0009117    .0347079
   soilqualityz |  -.0374994   .0219612    -1.71   0.091    -.0811793    .0061805
      inst_allz |   .0054241   .0234827     0.23   0.818    -.0412821    .0521304
    autoregionz |  -.0186591   .0124844    -1.49   0.139      -.04349    .0061718
          _cons |  -.0690688   .0081215    -8.50   0.000    -.0852222   -.0529155
----------------+----------------------------------------------------------------
        sigma_u |  .85208422
        sigma_e |  .30946341
            rho |  .88346819   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
. xtreg loggdppc_pppz oceanaccessz logtriz logstormcountz  trop_pctz dtr_avgz oilandgasz diamondz   iron_sqkmz alloyants_sqkmz  soilqualityz  if ~(countrycode=="ALB") & ~(countrycode=="BEN") & ~(count
> rycode=="BIH") & ~(countrycode=="BFA") & ~(countrycode=="ZAR") & ~(countrycode=="DOM") & ~(countrycode=="EGY") & ~(countrycode=="SLV") & ~(countrycode=="GMB") & ~(countrycode=="GTM") & ~(countrycode
> =="HND") & ~(countrycode=="JOR") & ~(countrycode=="KEN") & ~(countrycode=="KSV") & ~(countrycode=="LAO") & ~(countrycode=="LBN") & ~(countrycode=="LSO") & ~(countrycode=="MNE") & ~(countrycode=="NPL
> ") & ~(countrycode=="NER") & ~(countrycode=="PRY") & ~(countrycode=="SEN") & ~(countrycode=="SWZ") & ~(countrycode=="SYR") & ~(countrycode=="UGA") & ~(countrycode=="URY") & ~(countrycode=="UZB") & ~
> (countrycode=="VEN") & ~(countrycode=="ZMB") & ~(countrycode=="ZWE"), fe cluster(country)

Fixed-effects (within) regression               Number of obs      =      1362
Group variable: countrynum                      Number of groups   =        68

R-sq:  within  = 0.1313                         Obs per group: min =         1
       between = 0.4315                                        avg =      20.0
       overall = 0.3066                                        max =        79

                                                F(10,67)           =     41.42
corr(u_i, Xb)  = 0.3630                         Prob > F           =    0.0000

                                  (Std. Err. adjusted for 68 clusters in country)
---------------------------------------------------------------------------------
                |               Robust
  loggdppc_pppz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
   oceanaccessz |   .0638434   .0260295     2.45   0.017     .0118883    .1157986
        logtriz |  -.1034569   .0228102    -4.54   0.000    -.1489862   -.0579277
 logstormcountz |  -.0960565   .0316426    -3.04   0.003    -.1592153   -.0328976
      trop_pctz |  -.1234411   .0643307    -1.92   0.059    -.2518457    .0049635
       dtr_avgz |  -.0896511   .0289892    -3.09   0.003    -.1475139   -.0317883
     oilandgasz |   .0118601   .0040568     2.92   0.005     .0037627    .0199575
       diamondz |   .0312682   .0059453     5.26   0.000     .0194012    .0431351
     iron_sqkmz |   .0105058    .004562     2.30   0.024        .0014    .0196115
alloyants_sqkmz |   .0232026   .0108485     2.14   0.036      .001549    .0448562
   soilqualityz |  -.0629237    .021557    -2.92   0.005    -.1059516   -.0198958
          _cons |   .2023264   .0157688    12.83   0.000     .1708518    .2338011
----------------+----------------------------------------------------------------
        sigma_u |  .75108008
        sigma_e |  .36872191
            rho |  .80579876   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. xtreg loggdppc_pppz instXauto oceanaccessz logtriz logstormcountz  trop_pctz dtr_avgz oilandgasz diamondz   iron_sqkmz alloyants_sqkmz  soilqualityz inst_allz  autoregionz if ~(countrycode=="ALB") &
>  ~(countrycode=="BEN") & ~(countrycode=="BIH") & ~(countrycode=="BFA") & ~(countrycode=="ZAR") & ~(countrycode=="DOM") & ~(countrycode=="EGY") & ~(countrycode=="SLV") & ~(countrycode=="GMB") & ~(cou
> ntrycode=="GTM") & ~(countrycode=="HND") & ~(countrycode=="JOR") & ~(countrycode=="KEN") & ~(countrycode=="KSV") & ~(countrycode=="LAO") & ~(countrycode=="LBN") & ~(countrycode=="LSO") & ~(countryco
> de=="MNE") & ~(countrycode=="NPL") & ~(countrycode=="NER") & ~(countrycode=="PRY") & ~(countrycode=="SEN") & ~(countrycode=="SWZ") & ~(countrycode=="SYR") & ~(countrycode=="UGA") & ~(countrycode=="U
> RY") & ~(countrycode=="UZB") & ~(countrycode=="VEN") & ~(countrycode=="ZMB") & ~(countrycode=="ZWE"), fe cluster(country)

Fixed-effects (within) regression               Number of obs      =       989
Group variable: countrynum                      Number of groups   =        57

R-sq:  within  = 0.1456                         Obs per group: min =         4
       between = 0.4462                                        avg =      17.4
       overall = 0.2998                                        max =        63

                                                F(13,56)           =     72.82
corr(u_i, Xb)  = 0.3240                         Prob > F           =    0.0000

                                  (Std. Err. adjusted for 57 clusters in country)
---------------------------------------------------------------------------------
                |               Robust
  loggdppc_pppz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
      instXauto |   .0522161    .015344     3.40   0.001     .0214784    .0829539
   oceanaccessz |   .0393077   .0211806     1.86   0.069    -.0031221    .0817374
        logtriz |  -.1012033   .0281072    -3.60   0.001    -.1575089   -.0448977
 logstormcountz |  -.1242182   .0275181    -4.51   0.000    -.1793437   -.0690928
      trop_pctz |  -.1077606   .0834291    -1.29   0.202    -.2748891    .0593679
       dtr_avgz |  -.0938144   .0321439    -2.92   0.005    -.1582063   -.0294226
     oilandgasz |   .0133295    .003332     4.00   0.000     .0066547    .0200043
       diamondz |    .024931   .0062001     4.02   0.000     .0125107    .0373512
     iron_sqkmz |   .0111597   .0030997     3.60   0.001     .0049502    .0173692
alloyants_sqkmz |   .0187661    .008577     2.19   0.033     .0015842     .035948
   soilqualityz |  -.0589593   .0201791    -2.92   0.005    -.0993828   -.0185357
      inst_allz |   .0057925   .0284318     0.20   0.839    -.0511632    .0627481
    autoregionz |  -.0116826   .0169863    -0.69   0.494    -.0457103    .0223452
          _cons |   .1525841   .0152409    10.01   0.000     .1220529    .1831152
----------------+----------------------------------------------------------------
        sigma_u |  .72794924
        sigma_e |  .34691686
            rho |  .81491858   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
. xtreg loggdppc_pppz oceanaccessz logtriz logstormcountz  trop_pctz dtr_avgz oilandgasz diamondz   iron_sqkmz alloyants_sqkmz  soilqualityz yearsedz, fe cluster(country)

Fixed-effects (within) regression               Number of obs      =      1584
Group variable: countrynum                      Number of groups   =        87

R-sq:  within  = 0.3220                         Obs per group: min =         1
       between = 0.6969                                        avg =      18.2
       overall = 0.6825                                        max =        77

                                                F(11,86)           =     59.86
corr(u_i, Xb)  = 0.0634                         Prob > F           =    0.0000

                                  (Std. Err. adjusted for 87 clusters in country)
---------------------------------------------------------------------------------
                |               Robust
  loggdppc_pppz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
   oceanaccessz |   .0469212   .0184542     2.54   0.013     .0102356    .0836069
        logtriz |  -.0819329   .0203409    -4.03   0.000    -.1223692   -.0414966
 logstormcountz |  -.0649955   .0294412    -2.21   0.030    -.1235227   -.0064684
      trop_pctz |  -.0387532   .0403903    -0.96   0.340    -.1190465      .04154
       dtr_avgz |  -.0282507   .0189971    -1.49   0.141    -.0660157    .0095143
     oilandgasz |   .0087787   .0031236     2.81   0.006     .0025692    .0149881
       diamondz |   .0070124   .0036089     1.94   0.055    -.0001619    .0141866
     iron_sqkmz |   .0070027   .0027854     2.51   0.014     .0014655    .0125399
alloyants_sqkmz |   .0119968   .0057384     2.09   0.040     .0005893    .0234043
   soilqualityz |  -.0410134   .0164298    -2.50   0.014    -.0736748    -.008352
       yearsedz |    .749199    .060633    12.36   0.000     .6286647    .8697333
          _cons |   .0237844   .0012221    19.46   0.000     .0213549    .0262138
----------------+----------------------------------------------------------------
        sigma_u |  .55114439
        sigma_e |  .30430695
            rho |  .76636883   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. xtreg loggdppc_pppz instXauto oceanaccessz logtriz logstormcountz  trop_pctz dtr_avgz oilandgasz diamondz   iron_sqkmz alloyants_sqkmz  soilqualityz yearsedz inst_allz autoregionz , fe cluster(count
> ry)

Fixed-effects (within) regression               Number of obs      =      1173
Group variable: countrynum                      Number of groups   =        75

R-sq:  within  = 0.3753                         Obs per group: min =         1
       between = 0.6670                                        avg =      15.6
       overall = 0.6964                                        max =        63

                                                F(14,74)           =     74.85
corr(u_i, Xb)  = 0.0454                         Prob > F           =    0.0000

                                  (Std. Err. adjusted for 75 clusters in country)
---------------------------------------------------------------------------------
                |               Robust
  loggdppc_pppz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
      instXauto |   .0369166   .0127538     2.89   0.005     .0115041    .0623292
   oceanaccessz |    .029808   .0154475     1.93   0.057    -.0009717    .0605877
        logtriz |  -.0832402   .0247862    -3.36   0.001    -.1326279   -.0338526
 logstormcountz |  -.0799304   .0314726    -2.54   0.013     -.142641   -.0172199
      trop_pctz |    -.02271   .0513046    -0.44   0.659    -.1249366    .0795166
       dtr_avgz |  -.0185436   .0244912    -0.76   0.451    -.0673434    .0302561
     oilandgasz |   .0098017   .0028184     3.48   0.001     .0041859    .0154174
       diamondz |   .0041084   .0028218     1.46   0.150    -.0015142     .009731
     iron_sqkmz |   .0077718   .0019159     4.06   0.000     .0039542    .0115894
alloyants_sqkmz |   .0086501   .0045063     1.92   0.059    -.0003289     .017629
   soilqualityz |  -.0422646   .0175425    -2.41   0.018    -.0772189   -.0073103
       yearsedz |     .78843   .0666447    11.83   0.000     .6556376    .9212224
      inst_allz |   .0123404   .0191572     0.64   0.521    -.0258312    .0505121
    autoregionz |  -.0080372   .0122636    -0.66   0.514    -.0324728    .0163985
          _cons |  -.0176257    .005383    -3.27   0.002    -.0283515      -.0069
----------------+----------------------------------------------------------------
        sigma_u |  .56482599
        sigma_e |   .2841542
            rho |  .79802586   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/dianaricciulli/.ipython/stata/log_output.log
  log type:  text
 closed on:  26 Jun 2020, 11:03:00
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. // End of line deletion prevention
. 
end of do-file
